In [2]:
# Import modules
from bs4 import BeautifulSoup
import requests
from splinter import Browser
from selenium import webdriver
import pandas as pd
import time
from secret import username, password
from sqlalchemy import create_engine
import csv
import numpy as np
# import html5lib

### Load main hurricane dataset from csv to pandas dataframe

In [3]:
main_csv_df = pd.read_csv("Data/Hurricane Data 2019.csv")
main_csv_df

,Date,Name,Time,Status,Latitude,Longitude,MaximumWind,AirPressure
0,19500812,ABLE,0,TS,17.1N,55.5W,35,-999
1,19500812,ABLE,600,TS,17.7N,56.3W,40,-999
2,19500812,ABLE,1200,TS,18.2N,57.4W,45,-999
3,19500812,ABLE,1800,TS,19.0N,58.6W,50,-999
4,19500813,ABLE,0,TS,20.0N,60.0W,50,-999
...,...,...,...,...,...,...,...,...
29969,20191126,SEBASTIEN,1200,EX,52.2N,9.3W,45,970
29970,20191126,SEBASTIEN,1800,EX,52.2N,8.9W,40,972
29971,20191127,SEBASTIEN,0,EX,51.8N,8.2W,40,974
29972,20191127,SEBASTIEN,600,EX,51.4N,6.0W,40,976
29973,20191127,SEBASTIEN,1200,EX,51.3N,2.1W,40,980

In [4]:
main_df = main_csv_df #.drop(columns=("Unnamed: 8"))
main_df

,Date,Name,Time,Status,Latitude,Longitude,MaximumWind,AirPressure
0,19500812,ABLE,0,TS,17.1N,55.5W,35,-999
1,19500812,ABLE,600,TS,17.7N,56.3W,40,-999
2,19500812,ABLE,1200,TS,18.2N,57.4W,45,-999
3,19500812,ABLE,1800,TS,19.0N,58.6W,50,-999
4,19500813,ABLE,0,TS,20.0N,60.0W,50,-999
...,...,...,...,...,...,...,...,...
29969,20191126,SEBASTIEN,1200,EX,52.2N,9.3W,45,970
29970,20191126,SEBASTIEN,1800,EX,52.2N,8.9W,40,972
29971,20191127,SEBASTIEN,0,EX,51.8N,8.2W,40,974
29972,20191127,SEBASTIEN,600,EX,51.4N,6.0W,40,976
29973,20191127,SEBASTIEN,1200,EX,51.3N,2.1W,40,980

In [9]:
main_df.columns = main_df.columns.str.lower()

In [10]:
main_df.rename(columns={'maximumwind':'max_wind','airpressure':'air_pressure'}, inplace=True)
main_df

,date,name,time,status,latitude,longitude,max_wind,air_pressure
0,19500812,ABLE,0,TS,17.1N,55.5W,35,-999
1,19500812,ABLE,600,TS,17.7N,56.3W,40,-999
2,19500812,ABLE,1200,TS,18.2N,57.4W,45,-999
3,19500812,ABLE,1800,TS,19.0N,58.6W,50,-999
4,19500813,ABLE,0,TS,20.0N,60.0W,50,-999
...,...,...,...,...,...,...,...,...
29969,20191126,SEBASTIEN,1200,EX,52.2N,9.3W,45,970
29970,20191126,SEBASTIEN,1800,EX,52.2N,8.9W,40,972
29971,20191127,SEBASTIEN,0,EX,51.8N,8.2W,40,974
29972,20191127,SEBASTIEN,600,EX,51.4N,6.0W,40,976
29973,20191127,SEBASTIEN,1200,EX,51.3N,2.1W,40,980

In [11]:
# change format for latitudes and longitudes
longitudes = main_df['longitude']
long_list = []
for i in range(len(longitudes)):
    longitude = longitudes[i]
    W = 'W' in longitude
    d, m = map(float, longitude[:-1].split('.'))
    longitude = (d + m / 60.) * (-1 if W else 1)
    long_list.append(round(longitude, 2))
latitudes = main_df['latitude']
lat_list = []
for i in range(len(latitudes)):
    latitude = latitudes[i]
    N = 'N' in latitude
    d, m = map(float, latitude[:-1].split('.'))
    latitude = (d + m / 60.) * (1 if N else -1)
    lat_list.append(round(latitude, 2))
main_df['latitude_decimal'] = lat_list
main_df['longitude_decimal'] = long_list

In [12]:
len(main_df)

29974

In [14]:
clean_df = main_df.dropna()
clean_df

,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal
0,19500812,ABLE,0,TS,17.1N,55.5W,35,-999,17.02,-55.08
1,19500812,ABLE,600,TS,17.7N,56.3W,40,-999,17.12,-56.05
2,19500812,ABLE,1200,TS,18.2N,57.4W,45,-999,18.03,-57.07
3,19500812,ABLE,1800,TS,19.0N,58.6W,50,-999,19.00,-58.10
4,19500813,ABLE,0,TS,20.0N,60.0W,50,-999,20.00,-60.00
...,...,...,...,...,...,...,...,...,...,...
29969,20191126,SEBASTIEN,1200,EX,52.2N,9.3W,45,970,52.03,-9.05
29970,20191126,SEBASTIEN,1800,EX,52.2N,8.9W,40,972,52.03,-8.15
29971,20191127,SEBASTIEN,0,EX,51.8N,8.2W,40,974,51.13,-8.03
29972,20191127,SEBASTIEN,600,EX,51.4N,6.0W,40,976,51.07,-6.00
29973,20191127,SEBASTIEN,1200,EX,51.3N,2.1W,40,980,51.05,-2.02

In [15]:
len(clean_df)

29974

In [16]:
# Get names of indexes for which column name is "Unnamed"
indexNames = clean_df[clean_df['name'] == "Unnamed" ].index
# Delete these row indexes from dataFrame
clean_df.drop(indexNames , inplace=True)

In [17]:
len(clean_df)

29974

### Create year column 
#### Group by hurricane name to assign unique ID

In [18]:
# Extract year based on date column
dates = clean_df['date']
years = []
for i in range(len(dates)):
    split_str = int(str(dates[i])[:4])
    years.append(split_str)
clean_df['year'] = years
clean_df.head()

,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year
0,19500812,ABLE,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950
1,19500812,ABLE,600,TS,17.7N,56.3W,40,-999,17.12,-56.05,1950
2,19500812,ABLE,1200,TS,18.2N,57.4W,45,-999,18.03,-57.07,1950
3,19500812,ABLE,1800,TS,19.0N,58.6W,50,-999,19.00,-58.10,1950
4,19500813,ABLE,0,TS,20.0N,60.0W,50,-999,20.00,-60.00,1950

### Rename hurricanes to Capitalized

In [19]:
names = clean_df['name']
names_capitalized = names.str.title()
names_capitalized
clean_df['name'] = names_capitalized
clean_df

,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year
0,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950
1,19500812,Able,600,TS,17.7N,56.3W,40,-999,17.12,-56.05,1950
2,19500812,Able,1200,TS,18.2N,57.4W,45,-999,18.03,-57.07,1950
3,19500812,Able,1800,TS,19.0N,58.6W,50,-999,19.00,-58.10,1950
4,19500813,Able,0,TS,20.0N,60.0W,50,-999,20.00,-60.00,1950
...,...,...,...,...,...,...,...,...,...,...,...
29969,20191126,Sebastien,1200,EX,52.2N,9.3W,45,970,52.03,-9.05,2019
29970,20191126,Sebastien,1800,EX,52.2N,8.9W,40,972,52.03,-8.15,2019
29971,20191127,Sebastien,0,EX,51.8N,8.2W,40,974,51.13,-8.03,2019
29972,20191127,Sebastien,600,EX,51.4N,6.0W,40,976,51.07,-6.00,2019
29973,20191127,Sebastien,1200,EX,51.3N,2.1W,40,980,51.05,-2.02,2019

In [20]:
len(clean_df)

29974

In [21]:
# Get names of indexes for which column name is "Unnamed"
indexNames = clean_df[clean_df['name'] == "Unnamed" ].index
# Delete these row indexes from dataFrame
clean_df.drop(indexNames , inplace=True)

In [22]:
len(clean_df)

25042

#### Save cleaned csv df with all hurricanes data - to use when combined with ids

In [23]:
# Save cleaned csv df with all hurricanes data - to use when combined with ids
clean_df_no_ids = clean_df

In [24]:
# Check negative wind speeds converted to 0
min_wind_val = clean_df_no_ids['max_wind'].min()
print(min_wind_val)

10

In [25]:
# Replace negative wind speed with zeroes
clean_df_no_ids[clean_df_no_ids['max_wind'] < 0] = 0
clean_df_no_ids['max_wind']

0        35
1        40
2        45
3        50
4        50
         ..
29969    45
29970    40
29971    40
29972    40
29973    40
Name: max_wind, Length: 25042, dtype: int64

### Extract unique hurricanes names to create and associate ids

In [26]:
# Getting the duplicate movie by title and star released. 
dupl_df = clean_df.loc[clean_df.duplicated(subset=["name", "year"]), "name"].unique()
dupl_df

array(['Able', 'Baker', 'Charlie', 'Dog', 'Easy', 'Fox', 'George', 'How',
       'Item', 'Jig', 'King', 'Love', 'Mike', 'Alice', 'Barbara', 'Carol',
       'Dolly', 'Edna', 'Florence', 'Gail', 'Hazel', 'Gilda', 'Brenda',
       'Connie', 'Diane', 'Edith', 'Flora', 'Gladys', 'Ione', 'Hilda',
       'Janet', 'Katie', 'Anna', 'Betsy', 'Carla', 'Dora', 'Ethel',
       'Flossy', 'Greta', 'Audrey', 'Bertha', 'Carrie', 'Debbie',
       'Esther', 'Frieda', 'Alma', 'Becky', 'Cleo', 'Daisy', 'Ella',
       'Fifi', 'Gerda', 'Helene', 'Ilsa', 'Janice', 'Arlene', 'Beulah',
       'Cindy', 'Debra', 'Gracie', 'Hannah', 'Irene', 'Judith', 'Abby',
       'Donna', 'Frances', 'Hattie', 'Jenny', 'Inga', 'Celia', 'Ginny',
       'Helena', 'Isbell', 'Elena', 'Dorothy', 'Faith', 'Hallie', 'Inez',
       'Lois', 'Chloe', 'Doria', 'Fern', 'Ginger', 'Heidi', 'Candy',
       'Blanche', 'Camille', 'Eve', 'Francelia', 'Holly', 'Kara',
       'Laurie', 'Martha', 'Felice', 'Beth', 'Kristy', 'Laura', 'Alpha',
       'Agnes', 'Betty', 'Dawn', 'Delta', 'Alfa', 'Christine', 'Delia',
       'Ellen', 'Fran', 'Carmen', 'Elaine', 'Gertrude', 'Amy', 'Caroline',
       'Doris', 'Eloise', 'Faye', 'Belle', 'Dottie', 'Candice', 'Emmy',
       'Gloria', 'Anita', 'Babe', 'Clara', 'Evelyn', 'Amelia', 'Bess',
       'Cora', 'Flossie', 'Hope', 'Irma', 'Juliet', 'Kendra', 'Ana',
       'Bob', 'Claudette', 'David', 'Frederic', 'Henri', 'Allen',
       'Bonnie', 'Charley', 'Georges', 'Earl', 'Danielle', 'Hermine',
       'Ivan', 'Jeanne', 'Karl', 'Bret', 'Dennis', 'Emily', 'Floyd',
       'Gert', 'Harvey', 'Jose', 'Katrina', 'Alberto', 'Beryl', 'Chris',
       'Debby', 'Ernesto', 'Alicia', 'Barry', 'Chantal', 'Dean', 'Arthur',
       'Cesar', 'Diana', 'Edouard', 'Gustav', 'Hortense', 'Isidore',
       'Josephine', 'Klaus', 'Lili', 'Danny', 'Fabian', 'Isabel', 'Juan',
       'Kate', 'Andrew', 'Gilbert', 'Isaac', 'Joan', 'Keith', 'Allison',
       'Erin', 'Felix', 'Gabrielle', 'Hugo', 'Iris', 'Jerry', 'Karen',
       'Marco', 'Nana', 'Erika', 'Grace', 'Gordon', 'Humberto', 'Luis',
       'Marilyn', 'Noel', 'Opal', 'Pablo', 'Roxanne', 'Sebastien',
       'Tanya', 'Kyle', 'Bill', 'Alex', 'Lisa', 'Mitch', 'Nicole',
       'Lenny', 'Joyce', 'Leslie', 'Michael', 'Nadine', 'Lorenzo',
       'Michelle', 'Olga', 'Cristobal', 'Fay', 'Hanna', 'Larry', 'Mindy',
       'Nicholas', 'Odette', 'Peter', 'Gaston', 'Matthew', 'Otto',
       'Franklin', 'Ten', 'Lee', 'Maria', 'Nate', 'Ophelia', 'Philippe',
       'Rita', 'Nineteen', 'Stan', 'Tammy', 'Twenty-Two', 'Vince',
       'Wilma', 'Beta', 'Gamma', 'Epsilon', 'Zeta', 'Andrea', 'Ingrid',
       'Melissa', 'Fifteen', 'Ike', 'Omar', 'Sixteen', 'Paloma', 'One',
       'Fred', 'Eight', 'Ida', 'Two', 'Colin', 'Five', 'Fiona', 'Igor',
       'Julia', 'Paula', 'Richard', 'Shary', 'Tomas', 'Don', 'Katia',
       'Rina', 'Sean', 'Kirk', 'Oscar', 'Patty', 'Rafael', 'Sandy',
       'Tony', 'Dorian', 'Fernand', 'Gonzalo', 'Nine', 'Joaquin', 'Ian',
       'Four', 'Eleven', 'Three', 'Imelda', 'Nestor', 'Rebekah'],
      dtype=object)

In [27]:
len(dupl_df)

294

In [28]:
# Remove the duplicates 
clean_df = clean_df.drop_duplicates(subset=['name','year'], keep='first')
clean_df.head()
clean_df.to_csv("Data/clean_df.csv")

In [29]:
len(clean_df)

769

### Add hurricane index column

In [30]:
hurricanes_df = clean_df
hurricanes_df.head()

,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year
0,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950
51,19500818,Baker,1200,TD,12.0N,54.0W,30,-999,12.00,-54.00,1950
111,19500821,Charlie,1200,TS,11.1N,26.4W,35,-999,11.02,-26.07,1950
172,19500830,Dog,1800,HU,15.2N,55.6W,80,-999,15.03,-55.10,1950
246,19500901,Easy,600,TS,19.7N,83.2W,40,-999,19.12,-83.03,1950

In [31]:
hurricanes_df.reset_index()
hurricanes_df.head()

,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year
0,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950
51,19500818,Baker,1200,TD,12.0N,54.0W,30,-999,12.00,-54.00,1950
111,19500821,Charlie,1200,TS,11.1N,26.4W,35,-999,11.02,-26.07,1950
172,19500830,Dog,1800,HU,15.2N,55.6W,80,-999,15.03,-55.10,1950
246,19500901,Easy,600,TS,19.7N,83.2W,40,-999,19.12,-83.03,1950

In [32]:
hurricanes_df = hurricanes_df.reset_index(drop=True)
hurricanes_df

,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year
0,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950
1,19500818,Baker,1200,TD,12.0N,54.0W,30,-999,12.00,-54.00,1950
2,19500821,Charlie,1200,TS,11.1N,26.4W,35,-999,11.02,-26.07,1950
3,19500830,Dog,1800,HU,15.2N,55.6W,80,-999,15.03,-55.10,1950
4,19500901,Easy,600,TS,19.7N,83.2W,40,-999,19.12,-83.03,1950
...,...,...,...,...,...,...,...,...,...,...,...
764,20191017,Nestor,1200,DB,22.2N,95.7W,35,1007,22.03,-95.12,2019
765,20191025,Olga,1200,TS,24.7N,94.8W,35,1004,24.12,-94.13,2019
766,20191023,Pablo,1800,EX,40.0N,38.3W,40,1000,40.00,-38.05,2019
767,20191027,Rebekah,0,EX,40.5N,51.5W,35,1004,40.08,-51.08,2019
768,20191119,Sebastien,600,TS,19.4N,58.1W,35,1006,19.07,-58.02,2019

In [33]:
# Start index from 1
hurricanes_df.index += 1
hurricanes_df.head()

,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year
1,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950
2,19500818,Baker,1200,TD,12.0N,54.0W,30,-999,12.00,-54.00,1950
3,19500821,Charlie,1200,TS,11.1N,26.4W,35,-999,11.02,-26.07,1950
4,19500830,Dog,1800,HU,15.2N,55.6W,80,-999,15.03,-55.10,1950
5,19500901,Easy,600,TS,19.7N,83.2W,40,-999,19.12,-83.03,1950

In [34]:
# Reset index
hurricanes_df = hurricanes_df.reset_index()
hurricanes_df.head()

,index,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year
0,1,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950
1,2,19500818,Baker,1200,TD,12.0N,54.0W,30,-999,12.00,-54.00,1950
2,3,19500821,Charlie,1200,TS,11.1N,26.4W,35,-999,11.02,-26.07,1950
3,4,19500830,Dog,1800,HU,15.2N,55.6W,80,-999,15.03,-55.10,1950
4,5,19500901,Easy,600,TS,19.7N,83.2W,40,-999,19.12,-83.03,1950

In [35]:
hurricanes_df = hurricanes_df.rename(columns={'index': 'hurricane_id'})
hurricanes_df.head()

,hurricane_id,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year
0,1,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950
1,2,19500818,Baker,1200,TD,12.0N,54.0W,30,-999,12.00,-54.00,1950
2,3,19500821,Charlie,1200,TS,11.1N,26.4W,35,-999,11.02,-26.07,1950
3,4,19500830,Dog,1800,HU,15.2N,55.6W,80,-999,15.03,-55.10,1950
4,5,19500901,Easy,600,TS,19.7N,83.2W,40,-999,19.12,-83.03,1950

In [36]:
hurricanes_df.to_csv("Data/00_Hurricane Data 2019_with_unique_IDs.csv")

In [37]:
# Get names of indexes for which column name is "Unnamed"
indexNames = hurricanes_df[hurricanes_df['name'] == "Unnamed" ].index
# Delete these row indexes from dataFrame
clean_df.drop(indexNames , inplace=True)

C:\Users\Clay\anaconda3\envs\PythonData\lib\site-packages\pandas\core\frame.py:3990: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [38]:
len(clean_df)

769

In [39]:
hurricanes_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 769 entries, 0 to 768
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   hurricane_id       769 non-null    int64
 1   date               769 non-null    int64
 2   name               769 non-null    object
 3   time               769 non-null    int64
 4   status             769 non-null    object
 5   latitude           769 non-null    object
 6   longitude          769 non-null    object
 7   max_wind           769 non-null    int64
 8   air_pressure       769 non-null    int64
 9   latitude_decimal   769 non-null    float64
 10  longitude_decimal  769 non-null    float64
 11  year               769 non-null    int64
dtypes: float64(2), int64(6), object(4)
memory usage: 72.2+ KB

In [40]:
# Check negative wind speeds displayed in plotly
min_wind_val = main_df['max_wind'].min()
print(min_wind_val)

-99

In [41]:
# Check minimum values
main_df['max_wind']

0        35
1        40
2        45
3        50
4        50
         ..
29969    45
29970    40
29971    40
29972    40
29973    40
Name: max_wind, Length: 29974, dtype: int64

In [42]:
hurricanes_df[hurricanes_df['max_wind'] < 0] = 0
hurricanes_df['max_wind']

0      35
1      30
2      35
3      80
4      40
       ..
764    35
765    35
766    40
767    35
768    35
Name: max_wind, Length: 769, dtype: int64

In [43]:
hurricanes_df

,hurricane_id,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year
0,1,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950
1,2,19500818,Baker,1200,TD,12.0N,54.0W,30,-999,12.00,-54.00,1950
2,3,19500821,Charlie,1200,TS,11.1N,26.4W,35,-999,11.02,-26.07,1950
3,4,19500830,Dog,1800,HU,15.2N,55.6W,80,-999,15.03,-55.10,1950
4,5,19500901,Easy,600,TS,19.7N,83.2W,40,-999,19.12,-83.03,1950
...,...,...,...,...,...,...,...,...,...,...,...,...
764,765,20191017,Nestor,1200,DB,22.2N,95.7W,35,1007,22.03,-95.12,2019
765,766,20191025,Olga,1200,TS,24.7N,94.8W,35,1004,24.12,-94.13,2019
766,767,20191023,Pablo,1800,EX,40.0N,38.3W,40,1000,40.00,-38.05,2019
767,768,20191027,Rebekah,0,EX,40.5N,51.5W,35,1004,40.08,-51.08,2019
768,769,20191119,Sebastien,600,TS,19.4N,58.1W,35,1006,19.07,-58.02,2019

In [44]:
len(hurricanes_df)

769

In [45]:
# Check negative wind speeds converted to 0
min_wind_val = hurricanes_df['max_wind'].min()
print(min_wind_val)

10

In [46]:
hurricanes_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 769 entries, 0 to 768
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   hurricane_id       769 non-null    int64
 1   date               769 non-null    int64
 2   name               769 non-null    object
 3   time               769 non-null    int64
 4   status             769 non-null    object
 5   latitude           769 non-null    object
 6   longitude          769 non-null    object
 7   max_wind           769 non-null    int64
 8   air_pressure       769 non-null    int64
 9   latitude_decimal   769 non-null    float64
 10  longitude_decimal  769 non-null    float64
 11  year               769 non-null    int64
dtypes: float64(2), int64(6), object(4)
memory usage: 72.2+ KB

#### Merge clean_df_no_ids with hurricanes_df to get a master df with all data

In [48]:
clean_df_no_ids

,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year
0,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950
1,19500812,Able,600,TS,17.7N,56.3W,40,-999,17.12,-56.05,1950
2,19500812,Able,1200,TS,18.2N,57.4W,45,-999,18.03,-57.07,1950
3,19500812,Able,1800,TS,19.0N,58.6W,50,-999,19.00,-58.10,1950
4,19500813,Able,0,TS,20.0N,60.0W,50,-999,20.00,-60.00,1950
...,...,...,...,...,...,...,...,...,...,...,...
29969,20191126,Sebastien,1200,EX,52.2N,9.3W,45,970,52.03,-9.05,2019
29970,20191126,Sebastien,1800,EX,52.2N,8.9W,40,972,52.03,-8.15,2019
29971,20191127,Sebastien,0,EX,51.8N,8.2W,40,974,51.13,-8.03,2019
29972,20191127,Sebastien,600,EX,51.4N,6.0W,40,976,51.07,-6.00,2019
29973,20191127,Sebastien,1200,EX,51.3N,2.1W,40,980,51.05,-2.02,2019

In [49]:
# Filter columns from hurricanes_df before merge
temp_hurr_df = hurricanes_df[['name','year','hurricane_id']]
temp_hurr_df

          name  year  hurricane_id
0         Able  1950             1
1        Baker  1950             2
2      Charlie  1950             3
3          Dog  1950             4
4         Easy  1950             5
..         ...   ...           ...
764     Nestor  2019           765
765       Olga  2019           766
766      Pablo  2019           767
767    Rebekah  2019           768
768  Sebastien  2019           769

[769 rows x 3 columns]

In [50]:
# Merge two dataframes on both 'name' and 'year' columns to avoid duplicated entries
master_df = pd.merge(clean_df_no_ids, temp_hurr_df,  
                  how='left', left_on=['name','year'], right_on = ['name','year'])

In [54]:
master_df.head()

,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year,hurricane_id
0,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950,1
1,19500812,Able,600,TS,17.7N,56.3W,40,-999,17.12,-56.05,1950,1
2,19500812,Able,1200,TS,18.2N,57.4W,45,-999,18.03,-57.07,1950,1
3,19500812,Able,1800,TS,19.0N,58.6W,50,-999,19.00,-58.10,1950,1
4,19500813,Able,0,TS,20.0N,60.0W,50,-999,20.00,-60.00,1950,1

In [55]:
# Check negative wind speeds after merge
min_wind_val = master_df['max_wind'].min()
print(min_wind_val)

10

In [56]:
master_df.tail()

,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year,hurricane_id
25037,20191126,Sebastien,1200,EX,52.2N,9.3W,45,970,52.03,-9.05,2019,769
25038,20191126,Sebastien,1800,EX,52.2N,8.9W,40,972,52.03,-8.15,2019,769
25039,20191127,Sebastien,0,EX,51.8N,8.2W,40,974,51.13,-8.03,2019,769
25040,20191127,Sebastien,600,EX,51.4N,6.0W,40,976,51.07,-6.00,2019,769
25041,20191127,Sebastien,1200,EX,51.3N,2.1W,40,980,51.05,-2.02,2019,769

In [57]:
len(master_df)

25042

In [58]:
# Drop null values after merge
master_df = master_df.dropna()

In [59]:
len(master_df)

25042

In [60]:
master_df['hurricane_id'] = master_df['hurricane_id'].astype(int)
master_df

,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year,hurricane_id
0,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950,1
1,19500812,Able,600,TS,17.7N,56.3W,40,-999,17.12,-56.05,1950,1
2,19500812,Able,1200,TS,18.2N,57.4W,45,-999,18.03,-57.07,1950,1
3,19500812,Able,1800,TS,19.0N,58.6W,50,-999,19.00,-58.10,1950,1
4,19500813,Able,0,TS,20.0N,60.0W,50,-999,20.00,-60.00,1950,1
...,...,...,...,...,...,...,...,...,...,...,...,...
25037,20191126,Sebastien,1200,EX,52.2N,9.3W,45,970,52.03,-9.05,2019,769
25038,20191126,Sebastien,1800,EX,52.2N,8.9W,40,972,52.03,-8.15,2019,769
25039,20191127,Sebastien,0,EX,51.8N,8.2W,40,974,51.13,-8.03,2019,769
25040,20191127,Sebastien,600,EX,51.4N,6.0W,40,976,51.07,-6.00,2019,769
25041,20191127,Sebastien,1200,EX,51.3N,2.1W,40,980,51.05,-2.02,2019,769

In [61]:
hurricanes_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 769 entries, 0 to 768
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   hurricane_id       769 non-null    int64
 1   date               769 non-null    int64
 2   name               769 non-null    object
 3   time               769 non-null    int64
 4   status             769 non-null    object
 5   latitude           769 non-null    object
 6   longitude          769 non-null    object
 7   max_wind           769 non-null    int64
 8   air_pressure       769 non-null    int64
 9   latitude_decimal   769 non-null    float64
 10  longitude_decimal  769 non-null    float64
 11  year               769 non-null    int64
dtypes: float64(2), int64(6), object(4)
memory usage: 72.2+ KB

### Merge main df with costliest df on name and keep hurricane_id as foreign key

### Mac (Irina) Connection

In [62]:
# https://splinter.readthedocs.io/en/latest/drivers/chrome.html
!which chromedriver

which: no chromedriver in (/c/Users/Clay/anaconda3/envs/PythonData:/c/Users/Clay/anaconda3/envs/PythonData/Library/mingw-w64/bin:/c/Users/Clay/anaconda3/envs/PythonData/Library/usr/bin:/c/Users/Clay/anaconda3/envs/PythonData/Library/bin:/c/Users/Clay/anaconda3/envs/PythonData/Scripts:/c/Users/Clay/anaconda3/envs/PythonData/bin:/c/Users/Clay/anaconda3/Scripts/condabin:/c/Users/Clay/bin:/mingw64/bin:/usr/local/bin:/usr/bin:/usr/bin:/mingw64/bin:/usr/bin:/c/Users/Clay/bin:/c/Program Files (x86)/Common Files/Oracle/Java/javapath:/c/Program Files (x86)/Intel/iCLS Client:/c/Program Files/Intel/iCLS Client:/c/Windows/system32:/c/Windows:/c/Windows/System32/Wbem:/c/Windows/System32/WindowsPowerShell/v1.0:/c/Program Files (x86)/Intel/Intel(R) Management Engine Components/DAL:/c/Program Files/Intel/Intel(R) Management Engine Components/DAL:/c/Program Files (x86)/Intel/Intel(R) Management Engine Components/IPT:/c/Program Files/Intel/Intel(R) Management Engine Components/IPT:/c/Program Files (x86)/NVIDIA Corporation/PhysX/Common:/c/Program Files/Intel/WiFi/bin:/c/Program Files/Common Files/Intel/WirelessCommon:/c/WINDOWS/system32:/c/WINDOWS:/c/WINDOWS/System32/Wbem:/c/WINDOWS/System32/WindowsPowerShell/v1.0:/c/WINDOWS/System32/OpenSSH:/c/Program Files/NVIDIA Corporation/NVIDIA NvDLISR:/c/WINDOWS/system32:/c/WINDOWS:/c/WINDOWS/System32/Wbem:/c/WINDOWS/System32/WindowsPowerShell/v1.0:/c/WINDOWS/System32/OpenSSH:/c/Program Files/MongoDB/Server/4.2/bin:/cmd:/c/Users/Clay/anaconda3:/c/Users/Clay/anaconda3/Library/mingw-w64/bin:/c/Users/Clay/anaconda3/Library/usr/bin:/c/Users/Clay/anaconda3/Library/bin:/c/Users/Clay/anaconda3/Scripts:/c/Users/Clay/AppData/Local/Microsoft/WindowsApps:/c/Users/Clay/AppData/Local/Programs/Microsoft VS Code/bin:/c/Users/Clay/anaconda3/bin:/c/Users/Clay/chromedriver.exe:/usr/bin/vendor_perl:/usr/bin/core_perl)

In [52]:
# executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
# browser = Browser('chrome', **executable_path, headless=False)

### Windows (Clay) Connection

In [63]:
executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
browser = Browser('chrome', **executable_path, headless=False)

### Amy Connection

In [ ]:
#

### Neil Connection

In [ ]:
#

# * * * MAKE SURE TO COMMENT IN / OUT YOUR CONNECTION / PATH * * *

### Dataset 1 - Web Scrape Wikipedia Most Costliest hurricanes

In [64]:
url = 'https://en.wikipedia.org/wiki/List_of_costliest_Atlantic_hurricanes'
# Irina Path
# executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
# Clay Path
executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
# Amy Path
#
# Neil Path
#
browser = Browser('chrome', **executable_path, headless=False)
browser.visit(url)
time.sleep(3)
print("Open web browser")
tables = pd.read_html(url)
most_costly_hurricanes = tables[0]
print("Read and save table")
browser.quit()
most_costly_hurricanes.head()

Open web browser
Read and save table

,Name,Nominal damage(Billions USD),Normalized damage(Billions USD),Season,Storm classificationat peak intensity,Areas affected,References
0,Katrina,$125.0,$116.9,2005,CategoryÂ 5 hurricane,Louisiana Mississippi The Bahamas United State...,[4][5]
1,Harvey,$125.0,$62.2,2017,CategoryÂ 4 hurricane,Texas Louisiana South America Central America ...,[5][6]
2,Maria,$90.0,NaN,2017,CategoryÂ 5 hurricane,Puerto Rico Lesser Antilles Greater Antilles C...,[7]
3,Irma,$77.2,$31.0,2017,CategoryÂ 5 hurricane,Lesser Antilles Greater Antilles Caribbean Sea...,[5]
4,Sandy,$68.7,$73.5,2012,Category 3 hurricane,The Caribbean United States East Coast Eastern...,[5][8]

In [65]:
# Create a copy of the df
renamed_cost_df = most_costly_hurricanes

In [66]:
# # Rename columns
renamed_cost_df = renamed_cost_df.rename(columns={'Name': 'name','Nominal damage(Billions USD)': 'damage_usd', 'Normalized damage(Billions USD)': 'norm_damage_usd', 
                'Season': 'year', 'Storm classificationat peak intensity': 'category', 'Areas affected':'states'})

In [67]:
# Drop Reference column
renamed_cost_df = renamed_cost_df.drop(columns=['References','states'])

In [68]:
renamed_cost_df.head()

      name damage_usd norm_damage_usd  year              category
0  Katrina     $125.0          $116.9  2005  CategoryÂ 5 hurricane
1   Harvey     $125.0           $62.2  2017  CategoryÂ 4 hurricane
2    Maria      $90.0             NaN  2017  CategoryÂ 5 hurricane
3     Irma      $77.2           $31.0  2017  CategoryÂ 5 hurricane
4    Sandy      $68.7           $73.5  2012  Category 3 hurricane

In [69]:
# Save to the csv file
renamed_cost_df.to_csv("Data/01_most_costly_hurricanes_wiki_web.csv")

In [70]:
# Read csv file into df
renamed_cost_df = pd.read_csv('Data/01_most_costly_hurricanes_wiki_web.csv', index_col=[0])

In [71]:
renamed_cost_df.head()

      name damage_usd norm_damage_usd  year              category
0  Katrina     $125.0          $116.9  2005  CategoryÂ 5 hurricane
1   Harvey     $125.0           $62.2  2017  CategoryÂ 4 hurricane
2    Maria      $90.0             NaN  2017  CategoryÂ 5 hurricane
3     Irma      $77.2           $31.0  2017  CategoryÂ 5 hurricane
4    Sandy      $68.7           $73.5  2012  Category 3 hurricane

In [72]:
len(renamed_cost_df)

61

## Prepare Cost data

In [73]:
cost_df = renamed_cost_df

In [74]:
cost_df["norm_damage_usd"] = cost_df["norm_damage_usd"].str.replace('$','')
cost_df["norm_damage_usd"] = cost_df["norm_damage_usd"].str.replace('<','')
cost_df["norm_damage_usd"] = cost_df["norm_damage_usd"].str.replace('>','')
cost_df["damage_usd"] = cost_df["damage_usd"].str.replace('$','')
cost_df["damage_usd"] = cost_df["damage_usd"].str.replace('<','')
cost_df["damage_usd"] = cost_df["damage_usd"].str.replace('>','')
cost_df['norm_damage_usd'] = cost_df['norm_damage_usd'].astype(float)
cost_df['norm_damage_usd'] = cost_df['norm_damage_usd'].dropna()
cost_df['damage_usd'] = cost_df['damage_usd'].astype(float)
cost_df['damage_usd'] = cost_df['damage_usd'].dropna()
cost_df = cost_df.dropna()
len(cost_df) # 54 count

54

In [75]:
len(cost_df)

54

In [76]:
len(cost_df['name'].unique())

54

In [77]:
cost_df.head()

      name  damage_usd  norm_damage_usd  year              category
0  Katrina       125.0            116.9  2005  CategoryÂ 5 hurricane
1   Harvey       125.0             62.2  2017  CategoryÂ 4 hurricane
3     Irma        77.2             31.0  2017  CategoryÂ 5 hurricane
4    Sandy        68.7             73.5  2012  Category 3 hurricane
5      Ike        38.0             35.2  2008  CategoryÂ 4 hurricane

In [78]:
hurricanes_df

,hurricane_id,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year
0,1,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950
1,2,19500818,Baker,1200,TD,12.0N,54.0W,30,-999,12.00,-54.00,1950
2,3,19500821,Charlie,1200,TS,11.1N,26.4W,35,-999,11.02,-26.07,1950
3,4,19500830,Dog,1800,HU,15.2N,55.6W,80,-999,15.03,-55.10,1950
4,5,19500901,Easy,600,TS,19.7N,83.2W,40,-999,19.12,-83.03,1950
...,...,...,...,...,...,...,...,...,...,...,...,...
764,765,20191017,Nestor,1200,DB,22.2N,95.7W,35,1007,22.03,-95.12,2019
765,766,20191025,Olga,1200,TS,24.7N,94.8W,35,1004,24.12,-94.13,2019
766,767,20191023,Pablo,1800,EX,40.0N,38.3W,40,1000,40.00,-38.05,2019
767,768,20191027,Rebekah,0,EX,40.5N,51.5W,35,1004,40.08,-51.08,2019
768,769,20191119,Sebastien,600,TS,19.4N,58.1W,35,1006,19.07,-58.02,2019

In [79]:
# Merge two dataframes on both 'name' and 'year' columns to avoid duplicated entries
new_df = pd.merge(cost_df, hurricanes_df,  
                  how='left', left_on=['name','year'], right_on = ['name','year'])

In [80]:
len(new_df)

54

In [81]:
new_df.head()

,name,damage_usd,norm_damage_usd,year,category,hurricane_id,date,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal
0,Katrina,125.0,116.9,2005,CategoryÂ 5 hurricane,532,20050823,1800,TD,23.1N,75.1W,30,1008,23.02,-75.02
1,Harvey,125.0,62.2,2017,CategoryÂ 4 hurricane,724,20170816,600,LO,13.7N,45.8W,25,1013,13.12,-45.13
2,Irma,77.2,31.0,2017,CategoryÂ 5 hurricane,725,20170830,0,TD,16.1N,26.9W,30,1008,16.02,-26.15
3,Sandy,68.7,73.5,2012,Category 3 hurricane,663,20121021,1800,LO,14.3N,77.4W,25,1006,14.05,-77.07
4,Ike,38.0,35.2,2008,CategoryÂ 4 hurricane,586,20080901,600,TD,17.2N,37.0W,30,1006,17.03,-37.00

In [82]:
new_df = new_df.dropna()

In [84]:
# Sort merged df by norm_damage_usd column in descending order 
sorted_new_df = new_df.sort_values(by=['norm_damage_usd'], ascending=False)
sorted_new_df.head(54)

,name,damage_usd,norm_damage_usd,year,category,hurricane_id,date,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal
0,Katrina,125.00,116.9,2005,CategoryÂ 5 hurricane,532,20050823,1800,TD,23.1N,75.1W,30,1008,23.02,-75.02
6,Andrew,27.30,106.0,1992,CategoryÂ 5 hurricane,363,19920816,1800,TD,10.8N,35.5W,25,1010,10.13,-35.08
3,Sandy,68.70,73.5,2012,Category 3 hurricane,663,20121021,1800,LO,14.3N,77.4W,25,1006,14.05,-77.07
1,Harvey,125.00,62.2,2017,CategoryÂ 4 hurricane,724,20170816,600,LO,13.7N,45.8W,25,1013,13.12,-45.13
4,Ike,38.00,35.2,2008,CategoryÂ 4 hurricane,586,20080901,600,TD,17.2N,37.0W,30,1006,17.03,-37.00
5,Wilma,27.40,31.9,2005,CategoryÂ 5 hurricane,544,20051015,1800,TD,17.6N,78.5W,25,1004,17.10,-78.08
2,Irma,77.20,31.0,2017,CategoryÂ 5 hurricane,725,20170830,0,TD,16.1N,26.9W,30,1008,16.02,-26.15
9,Charley,16.90,26.9,2004,CategoryÂ 4 hurricane,508,20040809,1200,TD,11.4N,59.2W,30,1010,11.07,-59.03
47,Camille,1.42,26.4,1969,CategoryÂ 5 hurricane,162,19690814,0,TD,18.3N,79.7W,30,-999,18.05,-79.12
33,Agnes,2.10,26.0,1972,CategoryÂ 1 hurricane,192,19720614,1200,TD,20.0N,89.0W,25,-999,20.00,-89.00
7,Ivan,26.10,25.9,2004,CategoryÂ 5 hurricane,514,20040902,1800,TD,9.7N,27.6W,25,1009,9.12,-27.10
14,Hugo,9.47,25.1,1989,CategoryÂ 5 hurricane,338,19890910,1200,TD,13.2N,20.0W,25,1010,13.03,-20.00
13,Frances,10.10,16.5,2004,CategoryÂ 4 hurricane,511,20040825,0,TD,11.1N,35.2W,25,1009,11.02,-35.03
8,Rita,18.50,14.9,2005,CategoryÂ 5 hurricane,538,20050918,0,TD,21.3N,69.9W,25,1009,21.05,-69.15
18,Floyd,6.50,13.9,1999,CategoryÂ 4 hurricane,442,19990907,1800,TD,14.6N,45.6W,25,1008,14.10,-45.10
17,Jeanne,7.94,13.6,2004,CategoryÂ 3 hurricane,515,20040913,1800,TD,15.9N,60.0W,25,1010,15.15,-60.00
27,Alicia,3.00,13.6,1983,CategoryÂ 3 hurricane,281,19830815,1200,TD,27.3N,90.5W,30,1009,27.05,-90.08
21,Fran,5.00,11.1,1996,CategoryÂ 3 hurricane,408,19960823,1200,TD,14.0N,21.0W,25,1012,14.00,-21.00
11,Irene,14.20,10.8,2011,CategoryÂ 3 hurricane,635,20110821,0,TS,15.0N,59.0W,45,1006,15.00,-59.00
22,Opal,4.70,10.0,1995,CategoryÂ 4 hurricane,398,19950927,1800,TD,19.1N,87.3W,25,1004,19.02,-87.05
10,Matthew,16.50,8.6,2016,CategoryÂ 5 hurricane,713,20160928,1200,TS,13.4N,59.8W,50,1009,13.07,-59.13
16,Gustav,8.31,6.0,2008,CategoryÂ 4 hurricane,584,20080825,0,TD,13.5N,67.4W,25,1008,13.08,-67.07
44,Roxanne,1.50,6.0,1995,CategoryÂ 3 hurricane,400,19951007,1800,TD,14.0N,82.1W,25,1005,14.00,-82.02
39,Allen,1.57,6.0,1980,CategoryÂ 5 hurricane,254,19800731,1200,DB,11.0N,30.0W,25,-999,11.00,-30.00
40,David,1.54,6.0,1979,CategoryÂ 5 hurricane,249,19790825,1200,TD,11.7N,36.1W,25,1008,11.12,-36.02
41,Alex,1.52,6.0,2010,CategoryÂ 2 hurricane,606,20100624,1800,LO,15.9N,82.0W,25,1007,15.15,-82.00
42,Juan,1.50,6.0,1985,CategoryÂ 1 hurricane,306,19851026,0,TD,24.5N,90.5W,30,1005,24.08,-90.08
43,Bob,1.50,6.0,1991,CategoryÂ 3 hurricane,357,19910816,0,TD,25.6N,74.3W,25,1014,25.10,-74.05
46,Betsy,1.42,6.0,1965,CategoryÂ 4 hurricane,129,19650827,0,TD,11.0N,50.5W,25,-999,11.00,-50.08
45,Ingrid,1.50,6.0,2013,CategoryÂ 1 hurricane,674,20130912,600,LO,19.3N,92.2W,25,1006,19.05,-92.03
37,Frederic,1.77,6.0,1979,CategoryÂ 4 hurricane,250,19790829,600,TD,11.0N,25.5W,25,1009,11.00,-25.08
48,Elena,1.30,6.0,1985,CategoryÂ 3 hurricane,301,19850828,0,TD,19.8N,74.0W,30,1012,19.13,-74.00
49,Isidore,1.28,6.0,2002,CategoryÂ 3 hurricane,486,20020914,1800,TD,10.0N,60.5W,25,1009,10.00,-60.08
50,Lili,1.16,6.0,2002,CategoryÂ 4 hurricane,489,20020921,1800,TD,10.2N,44.6W,25,1009,10.03,-44.10
51,Alberto,1.03,6.0,1994,Tropical storm,377,19940630,600,TD,21.7N,83.6W,25,1011,21.12,-83.10
52,Emily,1.01,6.0,2005,CategoryÂ 5 hurricane,525,20050711,0,TD,10.7N,42.4W,25,1010,10.12,-42.07
38,Dolly,1.60,6.0,2008,CategoryÂ 2 hurricane,581,20080720,1200,TS,17.8N,83.6W,40,1008,17.13,-83.10
35,Joan,1.87,6.0,1988,CategoryÂ 4 hurricane,329,19881010,1800,TD,8.9N,42.2W,25,1010,8.15,-42.03
36,Fifi,1.80,6.0,1974,CategoryÂ 2Â hurricane,211,19740914,1200,TD,15.3N,65.0W,30,-999,15.05,-65.00
15,Allison,8.50,6.0,2001,Tropical storm,463,20010605,1200,TS,27.5N,95.0W,40,1007,27.08,-95.00
34,Dean,1.95,6.0,2007,CategoryÂ 5 hurricane,564,20070813,600,TD,12.2N,28.9W,30,1006,12.03,-28.15
32,Marilyn,2.10,6.0,1995,CategoryÂ 3 hurricane,396,19950912,1800,TD,11.7N,50.9W,30,1006,11.12,-50.15
31,Michelle,2.35,6.0,2001,CategoryÂ 4 hurricane,475,20011029,1800,TD,13.3N,83.6W,30,1004,13.05,-83.10
30,Lee,2.80,6.0,2011,Tropical storm,639,20110902,0,TD,26.6N,91.4W,30,1007,26.10,-91.07
29,Luis,2.97,6.0,1995,CategoryÂ 4 hurricane,395,19950828,1800,TD,11.4N,27.5W,30,1008,11.07,-27.08
28,Gilbert,2.98,6.0,1988,CategoryÂ 5 hurricane,326,19880908,1800,TD,12.0N,54.0W,25,1008,12.00,-54.00
12,Georges,13.90,6.0,1998,CategoryÂ 4 hurricane,429,19980915,1200,TD,9.7N,25.1W,30,1009,9.12,-25.02
26,Isaac,3.11,6.0,2012,CategoryÂ 1 hurricane,654,20120820,1200,LO,15.7N,44.8W,25,1010,15.12,-44.13
25,Dennis,3.98,6.0,2005,CategoryÂ 4 hurricane,524,20050704,1800,TD,12.0N,60.8W,25,1010,12.00,-60.13
24,Karl,3.90,6.0,2010,CategoryÂ 3 hurricane,618,20100913,1800,LO,16.3N,78.5W,25,1005,16.05,-78.08
23,Stan,3.96,6.0,2005,CategoryÂ 1 hurricane,540,20051001,1200,TD,18.9N,85.6W,25,1007,18.15,-85.10
20,Isabel,5.50,6.0,2003,CategoryÂ 5 hurricane,498,20030906,0,TD,13.8N,31.4W,30,1009,13.13,-31.07
19,Mitch,6.08,6.0,1998,CategoryÂ 5 hurricane,435,19981022,0,TD,11.6N,76.1W,30,1002,11.10,-76.02
53,Bonnie,1.00,6.0,1998,CategoryÂ 3 hurricane,424,19980819,1200,TD,14.7N,48.1W,25,1009,14.12,-48.02

In [85]:
cost_df = sorted_new_df[['hurricane_id','name','year','norm_damage_usd','damage_usd']]
cost_df.head()

   hurricane_id     name  year  norm_damage_usd  damage_usd
0           532  Katrina  2005            116.9       125.0
6           363   Andrew  1992            106.0        27.3
3           663    Sandy  2012             73.5        68.7
1           724   Harvey  2017             62.2       125.0
4           586      Ike  2008             35.2        38.0

In [86]:
# Re-save to the csv file
renamed_cost_df.to_csv("Data/01_most_costly_hurricanes_wiki_web.csv")

## Dataset 2 - Deadliest hurricanes in the atlantic
#### https://en.wikipedia.org/wiki/List_of_deadliest_Atlantic_hurricanes

In [87]:
url = 'https://en.wikipedia.org/wiki/List_of_deadliest_Atlantic_hurricanes'
# Irina Path
# executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
# Clay Path
executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
# Amy Path
#
# Neil Path
#
browser = Browser('chrome', **executable_path, headless=False)
browser.visit(url)
time.sleep(3)
print("Open web browser")
tables = pd.read_html(url)
most_deadliest_hurricanes = tables[2]
print("Read and save table")
browser.quit()
most_deadliest_hurricanes.head()

Open web browser
Read and save table

,Name,Dates active,Saffir-Simpson Category,Sustainedwind speeds,Pressure,Areas affected,Damage(US$),Deaths,Refs
0,San Marcos,"October 5â€“14, 1870",Category 3 hurricane,115Â mph (185Â km/h),959Â hPa (28.32Â inHg),"Cuba, Florida, Bahamas",NaN,"800â€“2,000",[1]
1,Sea Islands,"August 15Â â€“ September 2, 1893",Category 3 hurricane,120Â mph (195Â km/h),954Â hPa (28.17Â inHg),"Georgia, South Carolina",NaN,"1,000â€“2,000",NaN
2,Chenier Caminada,"September 27Â â€“ October 5, 1893",Category 4 hurricane,135Â mph (215Â km/h),948Â hPa (27.99Â inHg),"YucatÃ¡n Peninsula, Louisiana, Mississippi",NaN,"1,800â€“2,000",NaN
3,San Ciriaco,"August 3Â â€“ September 4, 1899",Category 4 hurricane,150Â mph (240Â km/h),930Â hPa (27.46Â inHg),"Lesser Antilles, Puerto Rico, Eastern United S...",NaN,3855,NaN
4,Galveston,"August 27Â â€“ September 15, 1900",Category 4 hurricane,145Â mph (230Â km/h),936Â hPa (27.64Â inHg),"The Caribbean, Texas",NaN,"8,000â€“12,000",NaN

In [88]:
most_fatal_hurricanes = most_deadliest_hurricanes.head(22)

In [89]:
most_fatal_hurricanes.tail()

,Name,Dates active,Saffir-Simpson Category,Sustainedwind speeds,Pressure,Areas affected,Damage(US$),Deaths,Refs
17,Mitch,"October 22Â â€“ November 5, 1998",Category 5 hurricane,180Â mph (285Â km/h),905Â hPa (26.72Â inHg),"Central America, YucatÃ¡n Peninsula, South Florida",NaN,"11,374â€“19,000",[7][8][9]
18,Jeanne,"September 13â€“28, 2004",Category 3 hurricane,120Â mph (195Â km/h),950Â hPa (28.05Â inHg),"The Caribbean, Eastern United States",NaN,3037,[5][10][11][12]
19,Katrina,"August 23â€“30, 2005",Category 5 hurricane,175Â mph (280Â km/h),902Â hPa (26.64Â inHg),"Bahamas, United States Gulf Coast",NaN,"1,245â€“1,836",[13]
20,Stan,"October 1â€“5, 2005",Category 1 hurricane,80Â mph (130Â km/h),977Â hPa (28.85Â inHg),"Mexico, Central America",NaN,1668,[5][14]
21,Maria,"September 16 â€“ October 2, 2017",Category 5 hurricane,175Â mph (280Â km/h),908Â hPa (26.81Â inHg),"Lesser Antilles (particularly Dominica), Puert...",NaN,3059,[15]

In [90]:
len(most_fatal_hurricanes)

22

In [133]:
# Create a copy of the df
fatal_df = most_fatal_hurricanes
len(fatal_df)

22

In [134]:
dates_active = fatal_df['Dates active']
dates_active

0                  October 5â€“14, 1870
1       August 15Â â€“ September 2, 1893
2      September 27Â â€“ October 5, 1893
3        August 3Â â€“ September 4, 1899
4      August 27Â â€“ September 15, 1900
5                  August 20â€“28, 1909
6                September 6â€“20, 1928
7      August 29Â â€“ September 17, 1930
8                September 6â€“13, 1931
9      October 30Â â€“ November 13, 1932
10                    June 4â€“18, 1934
11                October 18â€“27, 1935
12              September 21â€“30, 1955
13    September 26Â â€“ October 12, 1963
14              September 14â€“24, 1974
15      August 25Â â€“ September 8, 1979
16                November 8â€“21, 1994
17      October 22Â â€“ November 5, 1998
18              September 13â€“28, 2004
19                 August 23â€“30, 2005
20                  October 1â€“5, 2005
21     September 16 â€“ October 2, 2017
Name: Dates active, dtype: object

In [135]:
dates_list = []
for i in range(len(dates_active)):
    split_str = dates_active[i].split(",")[-1]
    print(split_str)
    dates_list.append(int(split_str))
print(len(dates_list))

 1870
 1893
 1893
 1899
 1900
 1909
 1928
 1930
 1931
 1932
 1934
 1935
 1955
 1963
 1974
 1979
 1994
 1998
 2004
 2005
 2005
 2017
22

In [136]:
fatal_df['year'] = dates_list
fatal_df.head()

<ipython-input-136-4f30443d4b90>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  fatal_df['year'] = dates_list

,Name,Dates active,Saffir-Simpson Category,Sustainedwind speeds,Pressure,Areas affected,Damage(US$),Deaths,Refs,year
0,San Marcos,"October 5â€“14, 1870",Category 3 hurricane,115Â mph (185Â km/h),959Â hPa (28.32Â inHg),"Cuba, Florida, Bahamas",NaN,"800â€“2,000",[1],1870
1,Sea Islands,"August 15Â â€“ September 2, 1893",Category 3 hurricane,120Â mph (195Â km/h),954Â hPa (28.17Â inHg),"Georgia, South Carolina",NaN,"1,000â€“2,000",NaN,1893
2,Chenier Caminada,"September 27Â â€“ October 5, 1893",Category 4 hurricane,135Â mph (215Â km/h),948Â hPa (27.99Â inHg),"YucatÃ¡n Peninsula, Louisiana, Mississippi",NaN,"1,800â€“2,000",NaN,1893
3,San Ciriaco,"August 3Â â€“ September 4, 1899",Category 4 hurricane,150Â mph (240Â km/h),930Â hPa (27.46Â inHg),"Lesser Antilles, Puerto Rico, Eastern United S...",NaN,3855,NaN,1899
4,Galveston,"August 27Â â€“ September 15, 1900",Category 4 hurricane,145Â mph (230Â km/h),936Â hPa (27.64Â inHg),"The Caribbean, Texas",NaN,"8,000â€“12,000",NaN,1900

In [137]:
# # Drop columns
# fatal_df = fatal_df.drop(columns=['Dates active','Saffir-Simpson Category',
#                                           'Sustainedwind speeds','Pressure','Areas affected','Damage(US$)','Refs'])

In [138]:
# Select columns 
fatal_df = fatal_df[['Name','Deaths','year']]

In [139]:
fatal_df = fatal_df.rename(columns={'Name': 'name', 'Deaths': 'deaths'})
fatal_df.head(30)

                name         deaths  year
0         San Marcos      800â€“2,000  1870
1        Sea Islands    1,000â€“2,000  1893
2   Chenier Caminada    1,800â€“2,000  1893
3        San Ciriaco           3855  1899
4          Galveston   8,000â€“12,000  1900
5          Monterrey           4000  1909
6         Okeechobee           4075  1928
7          San Zenon    2,000â€“8,000  1930
8             Belize    1,500â€“2,500  1931
9               Cuba    2,500â€“3,107  1932
10   Central America    2,000â€“3,000  1934
11           JÃ©rÃ©mie           2150  1935
12             Janet           1023  1955
13             Flora           7193  1963
14       Fifi-Orlene           8210  1974
15             David           2068  1979
16            Gordon           1152  1994
17             Mitch  11,374â€“19,000  1998
18            Jeanne           3037  2004
19           Katrina    1,245â€“1,836  2005
20              Stan           1668  2005
21             Maria           3059  2017

In [140]:
fatal_df.head()

               name        deaths  year
0        San Marcos     800â€“2,000  1870
1       Sea Islands   1,000â€“2,000  1893
2  Chenier Caminada   1,800â€“2,000  1893
3       San Ciriaco          3855  1899
4         Galveston  8,000â€“12,000  1900

In [141]:
fatal_df["deaths"] = fatal_df["deaths"].str.replace(',','')
fatal_df["deaths"] = fatal_df["deaths"].str.replace('â€“',',')
fatal_df.head()

               name      deaths  year
0        San Marcos    800,2000  1870
1       Sea Islands   1000,2000  1893
2  Chenier Caminada   1800,2000  1893
3       San Ciriaco        3855  1899
4         Galveston  8000,12000  1900

In [142]:
fatal_list = fatal_df["deaths"]

In [143]:
num_avg = []
for i in range(len(fatal_list)):
    if "," in fatal_list[i]:
        num0 = fatal_list[i].split(",")[0]
        num1 = fatal_list[i].split(",")[1]
        num = (int(num1) + int(num0))/2
        num_avg.append(num)
    else: num_avg.append(fatal_list[i])
print(num_avg)

[1400.0, 1500.0, 1900.0, '3855', 10000.0, '4000', '4075', 5000.0, 2000.0, 2803.5, 2500.0, '2150', '1023', '7193', '8210', '2068', '1152', 15187.0, '3037', 1540.5, '1668', '3059']

In [144]:
fatal_df = fatal_df.drop(columns="deaths")

In [145]:
fatal_df['deaths'] = num_avg

In [146]:
fatal_df = fatal_df.head(22)

In [147]:
fatal_df.head()

               name  year deaths
0        San Marcos  1870   1400
1       Sea Islands  1893   1500
2  Chenier Caminada  1893   1900
3       San Ciriaco  1899   3855
4         Galveston  1900  10000

In [148]:
len(fatal_df)

22

In [149]:
# Merge two dataframes on both 'name' and 'year' columns to avoid duplicated entries
new_fatal_merged_df = pd.merge(fatal_df, hurricanes_df,  how='left', 
                               left_on=['name', 'year'], right_on = ['name','year'])
new_fatal_merged_df.head(60)

,name,year,deaths,hurricane_id,date,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal
0,San Marcos,1870,1400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Sea Islands,1893,1500,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Chenier Caminada,1893,1900,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,San Ciriaco,1899,3855,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Galveston,1900,10000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,Monterrey,1909,4000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,Okeechobee,1928,4075,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,San Zenon,1930,5000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,Belize,1931,2000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,Cuba,1932,2803.5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,Central America,1934,2500,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,JÃ©rÃ©mie,1935,2150,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,Janet,1955,1023,55.0,19550921.0,1200.0,TS,13.2N,52.6W,40.0,-999.0,13.03,-52.10
13,Flora,1963,7193,116.0,19630928.0,1200.0,TD,9.2N,46.3W,30.0,-999.0,9.03,-46.05
14,Fifi-Orlene,1974,8210,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,David,1979,2068,249.0,19790825.0,1200.0,TD,11.7N,36.1W,25.0,1008.0,11.12,-36.02
16,Gordon,1994,1152,383.0,19941108.0,1200.0,TD,11.9N,82.3W,25.0,1009.0,11.15,-82.05
17,Mitch,1998,15187,435.0,19981022.0,0.0,TD,11.6N,76.1W,30.0,1002.0,11.10,-76.02
18,Jeanne,2004,3037,515.0,20040913.0,1800.0,TD,15.9N,60.0W,25.0,1010.0,15.15,-60.00
19,Katrina,2005,1540.5,532.0,20050823.0,1800.0,TD,23.1N,75.1W,30.0,1008.0,23.02,-75.02
20,Stan,2005,1668,540.0,20051001.0,1200.0,TD,18.9N,85.6W,25.0,1007.0,18.15,-85.10
21,Maria,2017,3059,729.0,20170916.0,1200.0,TD,12.2N,49.7W,30.0,1006.0,12.03,-49.12

In [152]:
# Filter out unnamed hurricanes before 1975
fatal_df = new_fatal_merged_df[new_fatal_merged_df['year'] > 1973]
fatal_df.head()

,name,year,deaths,hurricane_id,date,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal
14,Fifi-Orlene,1974,8210,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,David,1979,2068,249.0,19790825.0,1200.0,TD,11.7N,36.1W,25.0,1008.0,11.12,-36.02
16,Gordon,1994,1152,383.0,19941108.0,1200.0,TD,11.9N,82.3W,25.0,1009.0,11.15,-82.05
17,Mitch,1998,15187,435.0,19981022.0,0.0,TD,11.6N,76.1W,30.0,1002.0,11.10,-76.02
18,Jeanne,2004,3037,515.0,20040913.0,1800.0,TD,15.9N,60.0W,25.0,1010.0,15.15,-60.00

In [155]:
# Filter out unnamed hurricanes named Fifi-Orlene
fatal_df = fatal_df.drop(index = 14)
fatal_df.head()

,name,year,deaths,hurricane_id,date,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal
15,David,1979,2068,249.0,19790825.0,1200.0,TD,11.7N,36.1W,25.0,1008.0,11.12,-36.02
16,Gordon,1994,1152,383.0,19941108.0,1200.0,TD,11.9N,82.3W,25.0,1009.0,11.15,-82.05
17,Mitch,1998,15187,435.0,19981022.0,0.0,TD,11.6N,76.1W,30.0,1002.0,11.10,-76.02
18,Jeanne,2004,3037,515.0,20040913.0,1800.0,TD,15.9N,60.0W,25.0,1010.0,15.15,-60.00
19,Katrina,2005,1540.5,532.0,20050823.0,1800.0,TD,23.1N,75.1W,30.0,1008.0,23.02,-75.02

In [156]:
len(fatal_df)

7

In [157]:
fatal_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 15 to 21
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               7 non-null      object
 1   year               7 non-null      int64
 2   deaths             7 non-null      object
 3   hurricane_id       7 non-null      float64
 4   date               7 non-null      float64
 5   time               7 non-null      float64
 6   status             7 non-null      object
 7   latitude           7 non-null      object
 8   longitude          7 non-null      object
 9   max_wind           7 non-null      float64
 10  air_pressure       7 non-null      float64
 11  latitude_decimal   7 non-null      float64
 12  longitude_decimal  7 non-null      float64
dtypes: float64(7), int64(1), object(5)
memory usage: 784.0+ bytes

In [158]:
# Convert hurricane_id back to integer
fatal_df['hurricane_id'] = fatal_df['hurricane_id'].astype(int)
fatal_df.head()

,name,year,deaths,hurricane_id,date,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal
15,David,1979,2068,249,19790825.0,1200.0,TD,11.7N,36.1W,25.0,1008.0,11.12,-36.02
16,Gordon,1994,1152,383,19941108.0,1200.0,TD,11.9N,82.3W,25.0,1009.0,11.15,-82.05
17,Mitch,1998,15187,435,19981022.0,0.0,TD,11.6N,76.1W,30.0,1002.0,11.10,-76.02
18,Jeanne,2004,3037,515,20040913.0,1800.0,TD,15.9N,60.0W,25.0,1010.0,15.15,-60.00
19,Katrina,2005,1540.5,532,20050823.0,1800.0,TD,23.1N,75.1W,30.0,1008.0,23.02,-75.02

In [99]:
fatal_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 15 to 21
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               7 non-null      object
 1   year               7 non-null      int64
 2   deaths             7 non-null      object
 3   hurricane_id       7 non-null      int64
 4   date               7 non-null      float64
 5   time               7 non-null      float64
 6   status             7 non-null      object
 7   latitude           7 non-null      object
 8   longitude          7 non-null      object
 9   max_wind           7 non-null      float64
 10  air_pressure       7 non-null      float64
 11  latitude_decimal   7 non-null      float64
 12  longitude_decimal  7 non-null      float64
dtypes: float64(6), int64(2), object(5)
memory usage: 784.0+ bytes

In [159]:
# Drop columns
fatal_df = fatal_df[['hurricane_id','name','year','deaths']]

In [160]:
fatal_df

    hurricane_id     name  year  deaths
15           249    David  1979    2068
16           383   Gordon  1994    1152
17           435    Mitch  1998   15187
18           515   Jeanne  2004    3037
19           532  Katrina  2005  1540.5
20           540     Stan  2005    1668
21           729    Maria  2017    3059

## Prepare plotly data for maximum winds

In [161]:
# Use master df to plot maximum winds
master_df.head()

,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year,hurricane_id
0,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950,1
1,19500812,Able,600,TS,17.7N,56.3W,40,-999,17.12,-56.05,1950,1
2,19500812,Able,1200,TS,18.2N,57.4W,45,-999,18.03,-57.07,1950,1
3,19500812,Able,1800,TS,19.0N,58.6W,50,-999,19.00,-58.10,1950,1
4,19500813,Able,0,TS,20.0N,60.0W,50,-999,20.00,-60.00,1950,1

In [162]:
# Groupby based on name and year and aggregate to find max winds
test_grouped_df = master_df.groupby(['name','year']).agg(
    max_wind=pd.NamedAgg(column='max_wind', aggfunc=max))
test_grouped_df = test_grouped_df.reset_index()
test_grouped_df.head()

   name  year  max_wind
0  Abby  1960        70
1  Abby  1964        60
2  Abby  1968        65
3  Able  1950       110
4  Able  1951        80

In [163]:
# Add column with name and year
name_year = []
for i in range(len(test_grouped_df)):
    name_year.append(f"{test_grouped_df['name'][i]}_{test_grouped_df['year'][i]}")
test_grouped_df['name_year'] = name_year
test_grouped_df.head()

   name  year  max_wind  name_year
0  Abby  1960        70  Abby_1960
1  Abby  1964        60  Abby_1964
2  Abby  1968        65  Abby_1968
3  Able  1950       110  Able_1950
4  Able  1951        80  Able_1951

In [164]:
len(test_grouped_df)

769

In [165]:
# Create df for pushing to postgresql
max_wind_plotly_df = test_grouped_df[['name','max_wind','name_year']]

In [167]:
# Sort the df in descending order
max_wind_plotly_df = max_wind_plotly_df.sort_values(by=['max_wind'], ascending=False)
max_wind_plotly_df

        name  max_wind     name_year
24     Allen       165    Allen_1980
281   Dorian       160   Dorian_2019
766    Wilma       160    Wilma_2005
454  Gilbert       160  Gilbert_1988
561     Irma       155     Irma_2017
..       ...       ...           ...
381  Fifteen        30  Fifteen_2019
764      Two        30      Two_2014
758      Ten        30      Ten_2011
752  Sixteen        25  Sixteen_2008
404     Four        25     Four_2017

[769 rows x 3 columns]

# Cost by State DAMAGES in millions (1980-2020)

In [208]:
cost_by_state_df = pd.read_csv('https://www.ncdc.noaa.gov/billions/state-cost-data.csv', skiprows=1)

In [209]:
cost_by_state_df.head()

,state,drought,flooding,freeze,severe storm,tropical cyclone,wildfire,winter storm
0,AK,0.0,0.0,0.0,0.0,0.0,1887.9,0.0
1,AL,5632.4,116.6,124.7,10259.9,18565.6,614.9,1845.0
2,AR,5447.8,3897.7,244.6,5032.4,323.1,0.0,488.0
3,AZ,766.4,493.2,0.0,4522.0,0.0,803.6,0.0
4,CA,9828.2,10958.0,12694.0,2908.3,0.0,63781.0,0.0

In [210]:
hurricane_related_cost = cost_by_state_df[['state', 'flooding', 'severe storm', 'tropical cyclone']]
hurricane_related_cost.head()

  state  flooding  severe storm  tropical cyclone
0    AK       0.0           0.0               0.0
1    AL     116.6       10259.9           18565.6
2    AR    3897.7        5032.4             323.1
3    AZ     493.2        4522.0               0.0
4    CA   10958.0        2908.3               0.0

In [211]:
hurricane_related_cost.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   state             53 non-null     object
 1   flooding          53 non-null     float64
 2   severe storm      53 non-null     float64
 3   tropical cyclone  53 non-null     float64
dtypes: float64(3), object(1)
memory usage: 1.8+ KB

In [212]:
hurricane_related_cost['flooding'] = hurricane_related_cost['flooding'].astype(int)
hurricane_related_cost['severe storm'] = hurricane_related_cost['severe storm'].astype(int)
hurricane_related_cost['tropical cyclone'] = hurricane_related_cost['tropical cyclone'].astype(int)

<ipython-input-212-f2b9fca96668>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hurricane_related_cost['flooding'] = hurricane_related_cost['flooding'].astype(int)
<ipython-input-212-f2b9fca96668>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hurricane_related_cost['severe storm'] = hurricane_related_cost['severe storm'].astype(int)
<ipython-input-212-f2b9fca96668>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hurricane_related_cost['tropical cyclone'] = hurricane_related_cost['tropical cyclone'].astype(int)

In [213]:
hurricane_related_cost.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   state             53 non-null     object
 1   flooding          53 non-null     int32
 2   severe storm      53 non-null     int32
 3   tropical cyclone  53 non-null     int32
dtypes: int32(3), object(1)
memory usage: 1.2+ KB

In [214]:
hurricane_related_cost['total_damage'] = hurricane_related_cost['flooding'] + hurricane_related_cost['severe storm'] + hurricane_related_cost['tropical cyclone']

<ipython-input-214-5b6bc5fa1672>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hurricane_related_cost['total_damage'] = hurricane_related_cost['flooding'] + hurricane_related_cost['severe storm'] + hurricane_related_cost['tropical cyclone']

In [215]:
hurricane_related_cost.head()

  state  flooding  severe storm  tropical cyclone  total_damage
0    AK         0             0                 0             0
1    AL       116         10259             18565         28940
2    AR      3897          5032               323          9252
3    AZ       493          4522                 0          5015
4    CA     10958          2908                 0         13866

In [216]:
hurricane_related_cost.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   state             53 non-null     object
 1   flooding          53 non-null     int32
 2   severe storm      53 non-null     int32
 3   tropical cyclone  53 non-null     int32
 4   total_damage      53 non-null     int32
dtypes: int32(4), object(1)
memory usage: 1.4+ KB

In [217]:
hurricane_related_cost = hurricane_related_cost.sort_values(by='total_damage', ascending=False)
hurricane_related_cost.head(10)

   state  flooding  severe storm  tropical cyclone  total_damage
44    US    150556        269086            954069       1373711
43    TX     12091         48767            194110        254968
8     FL      1423          3074            205563        210060
17    LA     17048          8051            152872        177971
38    PR         0             0            101548        101548
26    NC        56          5494             54860         60410
24    MS      3138          4142             51528         58808
33    NY      1696          2642             47308         51646
30    NJ       968          2757             34801         38526
23    MO     12614         17916               432         30962

In [218]:
cost_by_state_in_millions_df = hurricane_related_cost[['state','total_damage']]
cost_by_state_in_millions_df.head()

   state  total_damage
44    US       1373711
43    TX        254968
8     FL        210060
17    LA        177971
38    PR        101548

In [ ]:
# Prepare cost_by_state_in_millions_df to send to SQL, ***EDIT ETL*** (Note for Clay)

## Push table to PostgreSQL

### !!! Please import QuickDBD-export.sql in the repo root folder file in pgAdmin
### !!! Run SQL file to generate the tables and reference links
### UNCOMMENT cell below to run the rest of the code

In [168]:
# Connect to the local database
connection_string = f'{username}:{password}@localhost:5432/hurricanes_db'
engine = create_engine(f'postgresql://{connection_string}')

In [169]:
hurricanes_df

,hurricane_id,date,name,time,status,latitude,longitude,max_wind,air_pressure,latitude_decimal,longitude_decimal,year
0,1,19500812,Able,0,TS,17.1N,55.5W,35,-999,17.02,-55.08,1950
1,2,19500818,Baker,1200,TD,12.0N,54.0W,30,-999,12.00,-54.00,1950
2,3,19500821,Charlie,1200,TS,11.1N,26.4W,35,-999,11.02,-26.07,1950
3,4,19500830,Dog,1800,HU,15.2N,55.6W,80,-999,15.03,-55.10,1950
4,5,19500901,Easy,600,TS,19.7N,83.2W,40,-999,19.12,-83.03,1950
...,...,...,...,...,...,...,...,...,...,...,...,...
764,765,20191017,Nestor,1200,DB,22.2N,95.7W,35,1007,22.03,-95.12,2019
765,766,20191025,Olga,1200,TS,24.7N,94.8W,35,1004,24.12,-94.13,2019
766,767,20191023,Pablo,1800,EX,40.0N,38.3W,40,1000,40.00,-38.05,2019
767,768,20191027,Rebekah,0,EX,40.5N,51.5W,35,1004,40.08,-51.08,2019
768,769,20191119,Sebastien,600,TS,19.4N,58.1W,35,1006,19.07,-58.02,2019

In [170]:
hurricanes_df.to_sql(name="hurricanes", con=engine, if_exists='append', index=False)

In [171]:
master_df.to_sql(name="master", con=engine, if_exists='append', index=False)

In [172]:
cost_df.to_sql(name="cost", con=engine, if_exists='append', index=False)

In [173]:
fatal_df.to_sql(name="fatalities", con=engine, if_exists='append', index=False)

In [174]:
max_wind_plotly_df.to_sql(name="maxwinds", con=engine, if_exists='append', index=False)

In [ ]:
# Send cost_by_state_in_millions_df to SQL (Note for Clay)